{
    "intro": "Hello there. My name is Austin Lee and I am pleased to be telling you a little about myself. I am generally well-mannered and well-behaviored. I really enjoy classical music and programming. If I were to describe the attitude I aspire to be, it would definately be classy. Aside from that, I like puzzles and challenges. As the raven had once crowed, \"Nevermore\". Thank you for your time in reading this resume. Hover over the pink highlighted text to change this commentary to more awesome commentary on different subjects.",
    "geb": "GEB is the acronym for Douglas Hofstadter's famous work, Godel, Escher, Bach: An Eternal Golden Braid. It discusses a very very large variety of topics that I personally have quite an interest in, such as logic, mathematics, and symbols. Not to mention the word-fugues that I find ticklish. (Bach was famous for writing complicated structures of music known as fugues). I would recommend this bible of Computer Science to anyone.",
    "site": "This site is currently in development. Meanwhile, I've been trying some cool stuff on my resume. Also, Ive only recently figured out how to launch a rails app on the Computer Science Club servers, which I am using to host my site",
    "RoRMinimalTime": "Before my spring co-op of 2011, I didn't know much about Ruby nor Rails. Instead, I was quite proficient in HTML, CSS, and PHP. Because of this background, I already understood how the information and data flows around the backend to frontend of a website. The switch to RoR was very obvious to me. Being just a web framework, I quickly grasped how RoR helped data flow around a website and how everything fits together.",
    "musicWriting": "Reason and Garageband are two programs that are used to compose music. Garageband can usually be found in Macs and is packaged with iLife. Before I came to university, I would play alot of piano and eventually became good but now, with my busy schedule, I would only occationally play piano. When I do, I would of course play my old songs but a thing I enjoy is to improvise, or to create music on the spot.",
    "logicGates": "This was done for a course on logic gates and circuits. Thus, everything was either simulation, or wired using AND, OR and other fun boolean operators.",
    "projectEuler": "Project Euler is a website with a series of math problems that require skill in computer science to solve. Because the questions often ask for the solution of a simple algorithm but with big numbers, using brute force takes alot of time. Thus, it requires mathmatical insight and creativity to solve most of the problems. I enjoy these problems mostly because each of them is like a mini-brain-teaser, while some of them are really-hard-brain-scratchers.",
    "lastCodeParty": "The CSC hosts code parties that take place in the math building and usually span until 2 to 4 am. At the last code party, I was working on a project for CS where I had to write an assembler for the MIPS assembly language. I also wrote most of the javascript for this resume/commentary.",
    "ukenAgileEnv": "The development style was very ongoing and the emphasis was put heavily on communication. Besides daily stand ups, we employed pair programming which turned out to be extremely efficient and productive.",
    "program": "I started Software Engineering in Sept 2010. They always said that the first few terms were the hardest so after performing well in my courses, I decided to try and pick up different degrees. I had a decent amount of free time on my hands and so I thought another goal would always be challenging. Unfortunately, I really couldn't fit another major or specialty program into the Engineering Specialty program I was already so during the second term, I talked to several profs, and got into a minor in Combinatorics and Optimization, and a minor in Computational Mathematics. I chose CO because I think Combinatorics and Enumeration is just something that every programmer should have a depth of knowledge in. Besides, in our 2B term, we're supposed to take something called 'Intro to Combinatorics', so it definately seemed practical. Optimization is obviously useful, especially if I ever wanted to do a research-based job. Computational Mathematics is also very practical because it brought the general mathematics into the broader field of computer science, including finance, economics, and physics."
}
